{"company":"Apple","jobTitle":"Senior Human Factors Engineer","location":"Cupertino, CA","skills":["human-centered research for Human-Computer Interaction or Man-Machine Interaction related topics","3+ years of experience in mentoring junior engineers","Proficiency in the diverse toolkit of experience assessment","Experience in rapidly acquiring familiarity with emergent technologies and software algorithms","Experience in Human-AI interaction domain research","Experience in human-centered research for VR/AR space, including virtual human-related topics","Proficiency in experimental design, statistical analysis, and data visualization","Experience in prototyping study tools to verify research hypotheses","Validated ability to present research findings and recommendations to all levels of partners, including executive management"],"responsibilities":["Initiate, plan, and lead investigational studies for the sensor-based interaction technologies.","Lead human factors studies for various input technologies across Apple products.","Assess and influence multi-modal interaction development.","Inform success criteria for sensor-based interactions.","Work with product development teams to design and lead investigations for camera-based interaction technologies such as spatial computing.","Identify human factors risks and propose crucial research throughout all stages of product and technology development."],"qualifications":["Master's or doctorate degree in human factors, human-computer interaction, computer graphics, applied psychology, or a relevant area in the consumer products industry."],"yearlyPay":null,"benefits":[],"postingDate":"2025-11-06","fetchDate":"2025-11-08T02:56:36.463Z","postSource":"https://jobs.apple.com/en-us/details/200630509-0836/senior-human-factors-engineer?team=HRDWR"}
{"company":"Apple","jobTitle":"Data Analyst - Strategic Data Solutions","location":"Austin, Texas","skills":["Statistical methods","Mathematical modeling","Data analytics","Python","Visualization techniques","Matplotlib","Tableau","Creating new metrics and analytics","Entity Relationship Diagrams (ERD)","Mitigating fraud, waste, and abuse","Financial crimes regulatory compliance","Providing business intelligence","Business acumen","Quantitative and technical background","Natural curiosity","Excellent communication (written and verbal)","Meeting facilitation","Collecting minutes","Gathering action items","Driving tasks to completion","Strong interpersonal skills","Developing strong partnerships","Creativity","Inquisitiveness","Self-improvement","Development of new skills","Working independently","Making key decisions on projects","Telling meaningful stories with data","Effective communication style shifting","Working in collaborative environments with minimal formal structure","Comfort with changing environments and competing priorities"],"responsibilities":["Apply statistical methods, mathematical modeling, and data analytics to help solve complex business problems, detect fraud & abuse, optimize performance & processes, and support strategic decision-making.","Work closely with partner teams, understanding their processes and analytic needs.","Develop technical solutions that can drive significant impact benefiting Apple.","Support the discovery of business problems.","Analyze and interpret new sources of data.","Perform ad-hoc and reoccurring investigations and analyses.","Work with machine learning engineers, software engineers, and engineering program managers to generate seamless business intelligence solutions for business partners.","Present results of analyses to business units.","Prepare documentation and analysis for integration testing, audits, and exams.","Conduct analytic investigations, perform system and workflow testing and validation, track and develop analytics, and develop/implement technical solutions."],"qualifications":[],"yearlyPay":null,"benefits":["Commitment to being an equal opportunity employer","Commitment to inclusion and diversity","Provides reasonable accommodation to applicants with physical and mental disabilities","Drug-free workplace","Considers for employment all qualified applicants with criminal histories in a manner consistent with applicable law"],"postingDate":"2025-11-06","fetchDate":"2025-11-08T03:08:03.572Z","postSource":"https://jobs.apple.com/en-us/details/200630587-3956/data-analyst-strategic-data-solutions?team=OPMFG"}
{"company":"Apple","jobTitle":"Senior Software Engineer (Technical Architect) - Wallet Platforms","location":"New York City, NY","skills":["Deep technical expertise","Willingness to engage with code and proofs-of-concept","Experience in translating diverse and complex requirements into robust, high-performance distributed systems","Practical experience and proven results in implementing and evolving large scale distributed systems with integrations of heterogeneous partner systems (Preferred)","Deep understanding of how institutions around the world operate, implement standards, and protect user data and privacy, specifically relating to Apple Wallet and digital credentials (e.g., credit/debit cards, transit passes, keys, mobile driver's licenses)","Deep experience in one of the current product domains such as Tokenization, Development Platform, or Mobile Wallets (Preferred)","Demonstrated experience leading large technical initiatives and driving change to align organizations","Comfortable explaining technical concepts to both technical and non-technical audiences (Preferred)"],"responsibilities":["Provide strategic technical leadership for the Wallet platform organization.","Align engineering efforts with long-term business goals and customer needs.","Collaborate with technical leaders across the engineering organization to define and promote a clear technical vision and roadmap.","Ensure alignment with broader organizational initiatives.","Represent the platform team's requirements across cross-functional groups.","Champion quality, reliability, performance, and security in all solutions.","Guide architectural decisions.","Engage in hands-on work on key projects.","Foster a practical, outcome-driven engineering approach.","Support a collaborative engineering culture across the organization.","Develop technical leadership through mentorship and coaching.","Support a technical roadmap that complements the product roadmap, fostering innovation while ensuring quality, scalability, and reliability.","Be key in defining the technical vision and architecture for essential platform capabilities.","Advocate for technical excellence, influence cross-functional roadmaps, and support the development and evolution of inclusive, industry-leading open standards that enhance interoperability and security.","Help align the organization around the technical aspects of product decisions, considering varied user experiences, privacy, security, performance, and compliance.","Ensure systems meet high reliability standards while embracing a culture of inclusivity and continuous improvement.","Play a key role in fostering a collaborative DevOps culture, mentoring, and supporting the professional growth of the next generation of diverse technical leaders."],"qualifications":["Bachelor's degree in Computer Science or a related field; or equivalent practical experience.","12+ years of industry experience as a software engineer.","3+ years of experience as a tech lead/architect."],"yearlyPay":249750,"benefits":["Apple employees have the opportunity to become an Apple shareholder through participation in Apple's discretionary employee stock programs."],"postingDate":"2025-10-17","fetchDate":"2025-11-08T03:08:33.299Z","postSource":"https://jobs.apple.com/en-us/details/200611668-2459/senior-software-engineer-technical-architect-wallet-platforms?team=SFTWR"}
{"company":"Apple","jobTitle":"Senior iCloud Efficiency Engineer","location":"Cupertino, CA, United States.","skills":["Experience at the intersection of systems engineering, infrastructure strategy, and applied analytics","Ability to contribute to cutting-edge forecasting and optimization strategies"],"responsibilities":["Optimize the design, deployment, and operation of iCloud services.","Perform in-depth analysis of infrastructure usage patterns and capacity planning to ensure scalability and reliability while minimizing resource wastage.","Collaborate closely with engineering teams, data scientists, and finance experts to develop and implement strategies that align with Apple's cloud sustainability and resource utilization principles.","Directly contribute to optimizing iCloud's performance, influencing the unit cost of services, and the overall customer experience.","Work at the intersection of systems engineering, infrastructure strategy, and applied analytics.","Contribute to cutting-edge forecasting and optimization strategies.","Drive efficiency in one of the world's largest cloud infrastructures, supporting billions of devices globally."],"qualifications":["Minimum Qualifications: 3+ years of relevant experience in large-scale cloud services or similar environments","Preferred Qualifications: Demonstrable experience in capacity planning and resource optimization"],"yearlyPay":171600,"benefits":["Comprehensive medical and dental coverage","Retirement benefits","A range of discounted products and free services","Reimbursement for certain educational expenses, including tuition, for formal education related to advancing your career at Apple","Eligible for discretionary bonuses or commission payments","Eligible for relocation assistance"],"postingDate":"2025-11-06","fetchDate":"2025-11-08T03:08:59.791Z","postSource":"https://jobs.apple.com/en-us/details/200614454-3337/senior-icloud-efficiency-engineer?team=SFTWR"}
{"company":"Apple","jobTitle":"Sr. ML Infrastructure Engineer, Siri User Experience Metrics and Data","location":"Cupertino, California, United States","skills":["Python (advanced, 5+ years)","Software design principles","pandas","scikit-learn","Deep learning frameworks (PyTorch, TensorFlow)","Distributed systems design","Data pipeline implementation","Spark","Flink","Kafka","Airflow","SQL","Data preprocessing","Building ML models (distributed processing: PySpark, Spark, Flink)","Training ML models (distributed processing: PySpark, Spark, Flink)","ML lifecycle tools (MLflow, Metaflow, Kubeflow, SageMaker, Vertex AI)","Model deployment (on-premise, server, on-device)","Model optimization","Large Language Models (LLMs) application (classification, labeling, enrichment)","LLM fine-tuning","Parameter-efficient adaptation (LoRA)","Problem-solving","Communication","Technical vision setting","Complex project leadership","Cross-functional impact driving","Anomaly detection","Time series modeling (Isolation Forest, autoencoders, ARIMA, LSTM)","Production framework development","LLM workflows (domain adaptation, RAG)","Optimized ML/LLM model deployment (Core ML, TensorFlow Lite, ONNX Runtime)","ML infrastructure development","Large-scale ML operations","Model serving","Distributed ML training","CI/CD for ML pipelines","Platform monitoring (millions of devices/events)","Composite metrics","Interpretability tools (SHAP, LIME)"],"responsibilities":["Design, build, and scale the foundational systems that power the machine learning lifecycle within the Siri User Experience Metrics team, encompassing everything from data ingestion to production model deployment.","Develop robust, scalable, and reproducible ML pipelines and services.","Lead the design, development, and scaling of machine learning infrastructure.","Build robust, scalable, and maintainable infrastructure to support the full ML lifecycle, including data ingestion, feature computation, training, deployment, and monitoring in production.","Design and maintain high-throughput, low-latency pipelines for both real-time and batch inference.","Automate model training and evaluation workflows with a focus on reproducibility and traceability.","Have significant influence and responsibility in shaping the architecture and scalability of the end-to-end machine learning infrastructure.","Lead initiatives to streamline model development workflows, ensure reliable deployment of ML models to production, and optimize performance across compute and storage.","Collaborate closely with Engineering, Product, Testing, and Quality teams to drive meaningful impact across all Apple platforms.","Design and implement scalable, reliable systems to transform raw data into actionable insights for leadership."],"qualifications":["7 years of development experience and a Bachelor's or Master's degree in Computer Science or a related field, OR 5 years of development experience and a PhD in Computer Science or a related field, with at least 3 years focused on large-scale machine learning infrastructure.","A track record of publications, patents, or open-source contributions in ML/LLMs, anomaly detection, or time series modeling."],"yearlyPay":null,"benefits":["Apple employees have the opportunity to become an Apple shareholder through participation in Apple's discretionary employee stock programs."],"postingDate":"2025-11-06","fetchDate":"2025-11-08T03:09:32.052Z","postSource":"https://jobs.apple.com/en-us/details/200616320-0836/sr-ml-infrastructure-engineer-siri-user-experience-metrics-and-data?team=SFTWR"}
{"company":"Apple","jobTitle":"Simulation Tools and Automation Engineer","location":"San Diego, California, United States.","skills":["ASIC/SoC verification","silicon validation","characterization","Python","shell scripting","Bash","Zsh","simulation environments","VCS","Xcelium","QuestaSim","digital design","verification methodologies","version control systems","Git","data analysis","data visualization tools","JMP","Pandas","Matplotlib","problem-solving","debugging","communication","collaboration","Jenkins","CI/CD systems","C++"],"responsibilities":["Develop, maintain, and enhance simulation tools and automation scripts for pre-silicon verification and post-silicon validation.","Design and implement robust data processing and analysis pipelines.","Collaborate with design, verification, and silicon validation teams to identify and address workflow inefficiencies.","Debug complex simulation and automation issues.","Contribute to the continuous improvement of engineering practices and infrastructure.","Document tools, methodologies, and best practices."],"qualifications":["BS or MS degree in Electrical Engineering, Computer Engineering, Computer Science, or a related field."],"yearlyPay":null,"benefits":["medical insurance","dental insurance","vision insurance","401(k) matching","Paid time off","Employee stock purchase plan","Tuition reimbursement"],"postingDate":"2025-10-25","fetchDate":"2025-11-08T03:09:51.504Z","postSource":"https://jobs.apple.com/en-us/details/200630204-0157/simulation-tools-and-automation-engineer?team=HRDWR"}
{"company":"Apple","jobTitle":"iOS Engineer, Photography Editing & Creativity Tools","location":"Cupertino","skills":["1+ years of industry experience building iOS applications in Swift or Objective-C.","Experience using Apple's core frameworks, ideally PhotoKit, Core Image, Core Graphics, AVFoundation, and Metal.","Familiarity with essential tools (Xcode, lldb, Instruments).","Prior experience solving real-world problems in a complex, high-performance environment.","Ability to work in a fast-paced environment within a multi-functional team.","Committed to fostering an open and inclusive work environment.","Exceptional technical skills and a genuine passion for the art and science of photography.","Creative problem solver who thrives in a fast-paced environment, working across teams and organizations.","Enjoy developing new features while writing robust and maintainable code.","Take the extra step to run projects through instruments and fine-tune performance to deliver the best user experience.","Staying up to date on how to design great experiences on all Apple platforms."],"responsibilities":["Contribute to the design and implementation of innovative features that leverage Apple's unique hardware and software capabilities, including advanced image processing, computational photography, and machine learning.","Partner closely with design, marketing, photography specialists, and other engineering teams to translate user needs into innovative features.","Shape the next generation of creative editing tools.","Be at the forefront of innovation, working with state-of-the-art technologies.","Apply deep engineering expertise and passion for photography to define the future of creative expression on Apple platforms."],"qualifications":["Bachelor's degree in Computer Science, Software Engineering, or a related subject area, or equivalent industry experience.","Experience with creative photography tooling.","Experience with media editing applications.","An understanding of modern camera technologies, image formats, color science, and computational photography principles.","Experience with large-scale asset management and optimizing for performance with high-resolution media."],"yearlyPay":209750,"benefits":["Apple employees have the opportunity to become an Apple shareholder through participation in Apple's discretionary employee stock programs, as part of their total compensation package."],"postingDate":"2025-11-05","fetchDate":"2025-11-08T03:10:13.147Z","postSource":"https://jobs.apple.com/en-us/details/200630605-0836/ios-engineer-photography-editing-creativity-tools?team=SFTWR"}
{"company":"Apple","jobTitle":"Software Engineer, FoundationDB","location":null,"skills":["Experience working with distributed systems, databases, and/or storage systems","Strong programming skills in C++, Go, or Rust","Experience with performance optimization and debugging complex systems","Excellent communication and collaboration skills","Passion for distributed systems, databases, and building high-quality software"],"responsibilities":[],"qualifications":[],"yearlyPay":null,"benefits":["medical","dental","vision","401(k)","stock options","paid time off"],"postingDate":null,"fetchDate":"2025-11-08T03:10:36.560Z","postSource":"https://jobs.apple.com/en-us/details/200630616-3577/software-engineer-foundationdb?team=SFTWR"}
{"company":"Apple","jobTitle":"Camera Mechanical Design Engineer","location":"Cupertino, California, United States","skills":["2+ years of relevant experience in the design of miniature components or optomechanical modules for high-volume products","Proven record of project ownership","Experience working in a fast-paced environment","Experience with electro-mechanical actuator design","Technical experience with mechanical or product design using 3D CAD software","Mechanical design using a CAD 3D molding and drafting package (NX experience is a plus)","Basic structural and thermal Finite Element Analysis (FEA) capabilities","Rigorous tolerance analysis of module designs and component parts","Excellent understanding of GD&T (Geometric Dimensioning and Tolerancing)","Demonstrated ability to design for actuators, VCMs (Voice Coil Motors), plastic injection molding, and metal stamping for mass production","Experience with various materials (research, selection, testing, and process ability)","Ability to author documentation on mechanical inspection and fixture design","PCB design experience (a plus)","Experience with dimensional tolerance analysis","Experience working in a cross-functional team environment","Opto-mechanical or optical design experience (preferred)","Electro-mechanical design experience (e.g., working with Electrical Engineers on PCB and flex layouts) (preferred)","Thermal dissipation design experience (preferred)","Design experience for high-volume mass production (preferred)","Statistical analysis experience using JMP or MATLAB (preferred)","Reliability testing experience (preferred)","Knowledge of FEA inputs and the ability to interpret results (preferred)","Experience in iterating on proven designs to find incremental modifications for year-over-year performance improvement (preferred)"],"responsibilities":["Design camera module structures and packaging in CAD.","Design injection molded, sheet metal, PCB, and other component parts.","Author detailed 2D manufacturing and inspection drawings.","Perform rigorous tolerance analysis of module designs and component parts.","Work with component part and camera manufacturing partners on design manufacturability and resolving mechanical issues.","Author clear documentation on mechanical inspection and test requirements.","Direct FEA engineers on the evaluation of camera designs.","Take ownership in the development of high-performance compact camera modules.","Lead camera hardware projects in engagements with product and technology teams.","Drive all mechanical aspects of a camera depth module from concept to mass production.","Create CAD designs and 2D drawings for components and assemblies.","Conduct tolerance analysis.","Engage with overseas mechanical vendors.","Review DFM feedback.","Approve inspection reports.","Analyze dimensional data during the New Product Introduction (NPI) cycle to identify trends and areas of concern."],"qualifications":["A Bachelor's degree in Mechanical Engineering, Optical Engineering, Electrical Engineering, Physics, Imaging Science, or a related field is required."],"yearlyPay":209750,"benefits":["Opportunity to become an Apple shareholder through participation in discretionary employee stock programs","Eligible for discretionary restricted stock unit awards","Purchase Apple stock at a discount if voluntarily participating in Apple's Employee Stock Purchase Plan","Comprehensive medical and dental coverage","Retirement benefits","A range of discounted products and free services","Reimbursement for certain educational expenses (including tuition) for formal education related to career advancement at Apple","Eligibility for discretionary bonuses or commission payments","Relocation assistance"],"postingDate":"2025-11-05","fetchDate":"2025-11-08T03:11:08.430Z","postSource":"https://jobs.apple.com/en-us/details/200629183-0836/camera-mechanical-design-engineer?team=HRDWR"}
{"company":"Apple","jobTitle":"AIML Senior Full-Stack Software Engineer, Machine Learning Platform Technology","location":"Cupertino, California, United States","skills":["Python","Scala","Java","Go","Apache Spark","Distributed systems","Docker","Kubernetes","MLFlow","ML lifecycle management tools","RESTful APIs","FastAPI","gRPC","Protobuf","Kafka","NoSQL databases","Cassandra","Solr","Zookeeper","Git","Jenkins","CI/CD platforms","Terraform","AWS","Azure","GCP","Data structures","Algorithms","Object-oriented design","Software engineering best practices","MLOps pipelines","MLOps infrastructure","Backend services","Frontend development","Objective-C","Swift","Security principles","Large-scale systems security"],"responsibilities":["Designing, developing, and deploying scalable, robust, and secure machine learning platform features and services.","Building and maintaining highly available APIs and intuitive user interfaces for the ML platform.","Collaborating closely with ML engineers and researchers to understand their needs and deliver innovative solutions.","Driving the adoption of software engineering best practices, including code reviews, testing, and documentation.","Troubleshooting and resolving complex technical issues across the platform.","Mentoring junior engineers and contributing to a culture of technical excellence."],"qualifications":["A Bachelor's or Master's degree in Computer Science or a related field, or equivalent practical experience.","At least 5 years of experience in software development, with a significant focus on building and operating large-scale distributed systems and/or machine learning platforms."],"yearlyPay":null,"benefits":["Medical, dental, and vision coverage","A 401(k) plan","Paid time off, including vacation, holidays, and sick leave","Paid family leave","Retirement and financial planning resources","Employee discounts","Health and wellness programs","Career development programs"],"postingDate":null,"fetchDate":"2025-11-08T03:11:32.342Z","postSource":"https://jobs.apple.com/en-us/details/200629484-1435/aiml-senior-full-stack-software-engineer-machine-learning-platform-technology?team=MLAI"}
{"company":"Apple","jobTitle":"AI/ML - Sr. Backend Engineer, Data and ML Innovation","location":"Cupertino, California, United States","skills":["8+ years of experience with distributed systems and large-scale data processing technologies such as Spark, Flink, Kafka, and Cassandra.","Strong programming skills in Scala or Java.","Proficiency in designing, developing, and deploying scalable backend services.","Experience with cloud platforms (AWS, Azure, GCP) and containerization technologies (Docker, Kubernetes).","Solid understanding of data warehousing, ETL processes, and data modeling.","Experience with machine learning pipelines and MLOps practices.","Excellent problem-solving and debugging skills.","Strong communication and collaboration abilities.","Experience with ML frameworks (e.g., TensorFlow, PyTorch) is considered a plus.","Familiarity with Apple's internal technologies and platforms is also a plus."],"responsibilities":["Design, develop, and maintain highly scalable and reliable backend services and data pipelines.","Work closely with ML engineers and data scientists to understand their needs and provide innovative solutions.","Building next-generation data platforms and tools to power AI/ML initiatives across Apple."],"qualifications":["Bachelor’s or Master’s degree in Computer Science, Engineering, or a related field."],"yearlyPay":null,"benefits":[],"postingDate":null,"fetchDate":"2025-11-08T03:12:11.281Z","postSource":"https://jobs.apple.com/en-us/details/200609199-3337/aiml-sr-backend-engineer-data-and-ml-innovation?team=MLAI"}
{"company":"Apple","jobTitle":"Optical Module Engineer","location":"San Jose, California, United States","skills":["Understanding of system requirements, display & optical behavior, and human perception","Proficiency in using geometrical optics or wave-optics tools","Ability to perform statistical analysis of data to determine optical performance and quality","Experience developing specifications and/or requirements for optical systems","Experience in optical metrology","Experience in ramping optical systems to mass production and managing domestic and international vendors","Proven track record in product development at the module level, from concept to mass production","Demonstrated ability to drive and meet key project targets","Experience in reliability testing and Root Cause/Failure Analysis and Corrective Action (RC / FACA) methodology","Knowledge of industry standards for testing displays and optical systems","Knowledge of optical thin film deposition and coating processes (PVD, CVD, spin, slot-die, etc.) and lamination processes (R2R)","Proven leadership skills and the ability to work with various Apple teams and overseas vendors","Proactive, self-motivated engineer who can take the initiative and lead improvement","Strong presentation and communication skills","Ability to thrive in a fast-paced and highly dynamic environment"],"responsibilities":["Drive the entire lens module end-to-end, from conceptual design to volume manufacturing","Collaborate effectively with key stakeholders such as Optical, Mechanical, Display, System, Software, Product Design, and external vendors","Define architecture for new imaging lens technologies with an understanding of system requirements, display & optical behavior, and human perception","Translate optics requirements and features into detailed plans, develop schedules, and deliver solutions in a predictable, timely manner","Use geometrical optics or wave-optics tools to architect new optical modules and to assess their expected performance and limitations","Work with multi-functional teams to assess risks, understand coverage needs, and establish priorities","Work with optics manufacturing suppliers and develop new techniques for optical components and modules","Identify novel characterization techniques to measure key performance metrics of complex and novel optical components","Perform statistical analysis of data to determine optical performance and quality","Regularly visit suppliers to support engineering builds and assist with failure analysis activities","Generate and maintain documentation of specifications, manufacturing, test, and failure analysis (FA) processes","Lead module development throughout the entire project phase, including specification development, build planning, figure-of-merit definition, Engineering Requirements Specification (ERS) creation, execution, and module validation and sign-off","Engage in proactive problem-solving across various technical domains, including optical design, human perception, product development, material science, manufacturing process, optical metrology, reliability testing, and failure analysis","Ensure the successful implementation of new display technologies and drive engineering excellence from initial concept to final mass production"],"qualifications":["B.S. (Bachelor of Science) degree in Physics, Optical Sciences, Electrical Engineering (EE), Materials Science, or a similar field","Minimum of 10 years of relevant industry experience","2+ years of experience leading projects","M.S. (Master of Science) or Ph.D. in Physics, Optical Science, Imaging, EE, or equivalent","5+ years of relevant experience (if holding an M.S./Ph.D.)"],"yearlyPay":null,"benefits":["Comprehensive medical and dental coverage","Retirement benefits","A range of discounted products and free services","Reimbursement for certain educational expenses (including tuition) related to advancing one's career at Apple"],"postingDate":"2025-11-05","fetchDate":"2025-11-08T03:12:50.427Z","postSource":"https://jobs.apple.com/en-us/details/200630243-3956/optical-module-engineer?team=HRDWR"}
{"company":"Apple","jobTitle":"Graphics Software Engineer","location":"Sunnyvale, California, United States","skills":["understanding of 3D engines","understanding of GPUs","understanding of the Display stack","understanding of lower-level programming","comfort in writing performant and real-time lower-level code","designing and implementing performance graphic algorithms","Excellent communication skills","curiosity","creativity in solving novel problems"],"responsibilities":["The role involves working in a team to develop system-level frameworks that enable innovative user experiences.","This includes close collaboration with other innovative teams across Apple and VPG.","Engineers are expected to be comfortable in a dynamic and creative environment, with an ambition to improve, innovate, and explore technologies to surprise and delight users.","Responsibilities also include working quickly and smartly to help determine the viability of ideas and technologies."],"qualifications":["A Bachelor of Science (BS) degree in Computer Science, Computer Graphics, or a related field.","A Master of Science (MS) or Doctor of Philosophy (PhD) degree in Computer Science, Computer Graphics, or a related field."],"yearlyPay":null,"benefits":["Comprehensive medical and dental coverage.","Retirement benefits.","A range of discounted products and free services.","Reimbursement for certain educational expenses, including tuition, for formal education related to advancing one's career at Apple.","The opportunity to become an Apple shareholder through participation in discretionary employee stock programs, including restricted stock unit awards and the option to purchase Apple stock at a discount via the Employee Stock Purchase Plan.","The role might also be eligible for discretionary bonuses or commission payments, as well as relocation assistance."],"postingDate":"2025-11-04","fetchDate":"2025-11-08T03:13:37.372Z","postSource":"https://jobs.apple.com/en-us/details/200630200-3956/graphics-software-engineer?team=SFTWR"}
{"company":"Apple","jobTitle":"Darwin Kernel Quality Engineer","location":null,"skills":["Software Quality Engineering","Software Integration","Investigating software regressions","Debugging software regressions","Triage software regressions","Programming","Scripting","Python","Objective-C","C++","Swift","iOS","macOS","Unix","Linux","Collaboration","Communication","Data analysis","Data-driven decision making"],"responsibilities":["Being a contributor to the pre-submission release and QA process.","Integrating software builds and managing the integration pipeline.","Performing in-depth triage of test failures to identify root causes.","Gathering and analyzing data to identify trends, patterns, and areas for improvement in the release pipeline.","Collaborating with development, QA, and other teams to drive resolution of identified gaps and issues.","Reviewing and contributing to test plans to ensure comprehensive test coverage.","Integrating software components.","Rigorously triaging test failures.","Collaborating with cross-functional teams to identify and resolve critical issues.","Your data-driven insights will directly impact the quality and stability of upcoming Apple products."],"qualifications":["Experience in a Software Quality Engineering or Software Integration role.","Proven ability to investigate, debug, and triage software regressions effectively.","Strong programming and scripting skills (Python preferred; experience with Objective-C/C++/Swift is a plus).","Solid understanding of iOS, macOS, or other operating systems (Unix/Linux).","Exceptional collaboration and communication skills.","Experience with data analysis and using data to drive decision-making.","B.S./M.S. in Computer Science or equivalent knowledge and experience."],"yearlyPay":167500,"benefits":["Opportunity to become an Apple shareholder through participation in Apple's discretionary employee stock programs.","Eligibility for discretionary restricted stock unit awards.","Ability to purchase Apple stock at a discount if voluntarily participating in Apple's Employee Stock Purchase Plan.","Reimbursement for certain educational expenses, including tuition.","Eligibility for discretionary bonuses or commission payments.","Relocation assistance."],"postingDate":"2025-11-04","fetchDate":"2025-11-08T03:14:01.569Z","postSource":"https://jobs.apple.com/en-us/details/200630272-0836/darwin-kernel-quality-engineer?team=SFTWR"}
{"company":"Apple","jobTitle":"Applied Research Engineer, Multimodal LLMs for Human Interaction","location":null,"skills":[],"responsibilities":[],"qualifications":[],"yearlyPay":null,"benefits":[],"postingDate":null,"fetchDate":"2025-11-08T03:14:13.417Z","postSource":"https://jobs.apple.com/en-us/details/200630255-3956/applied-research-engineer-multimodal-llms-for-human-interaction?team=MLAI"}
{"company":"Apple","jobTitle":"Staff Machine Learning Engineer, News Team","location":"Cupertino, California, United States","skills":["Python","Java","PyTorch","TensorFlow","Natural Language Processing (NLP)","Large Language Models (LLMs)","Machine Learning Model Design"],"responsibilities":["Design and implement state-of-the-art machine learning models that process text, personalize feeds, and \"make the impossible possible\".","Collect model training data, design model architecture, and train custom or fine-tuned models or adapters suited for application features.","Partner with cross-functional teams at the intersection of technology and liberal arts to design and implement end-to-end machine learning-enabled features.","Drive application features from concept, model design, development, and all the way to delivery.","Lead highly cross-functional software projects.","Mentor junior engineers.","Be part of Apple's thriving machine learning community."],"qualifications":["MS in Machine Learning, Computer Science, or a related field","At least 5 years of experience shipping machine learning models in products","Experience designing user-facing machine learning features with interdisciplinary partners","Experience with personalized ranking and scoring","Experience with text data and NLP tasks, including the use of Large Language Models (LLMs)","Experience delivering high-quality software at scale","Ability to communicate effectively","Ability to collaborate with partner teams","Commitment to fostering an open and inclusive work environment"],"yearlyPay":249750,"benefits":["Bonus potential","Equity potential"],"postingDate":"2025-11-03","fetchDate":"2025-11-08T03:14:37.206Z","postSource":"https://jobs.apple.com/en-us/details/200629989-0836/staff-machine-learning-engineer-news-team?team=SFTWR"}
{"company":"Apple","jobTitle":"AIML Resident, Input Experience NLP","location":"Cupertino, California","skills":["Proficiency in a programming language such as Python, Objective-C, C++, Swift, and/or R","Experience completing a moderate-sized software project","Demonstrated ability to connect and collaborate with others","Graduate degree in a STEM field or equivalent industry experience in software engineering","Academic, research, or industry experience in computer vision, large language models/generative AI, machine learning & ML research, or LLM optimization","Thesis, capstone project, internship, co-op, or proven experience in relevant fields"],"responsibilities":["The AIML Residency at Apple is a year-long program focused on applying domain expertise to innovate and build revolutionary machine learning and AI-based products and experiences.","Residents will work on high-impact projects.","Develop models and software that power Apple Intelligence and text input features across all supported languages on Apple's platforms.","Contribute to features like Writing Tools, Smart Replies, auto-correction, and predictive typing.","Integrate natural language intelligence into Apple products.","Directly contribute to shipping products and develop new features and capabilities to advance digital communication.","Integrating pioneering large language models (LLMs) into Apple products.","Developing innovative modeling-based solutions to improve runtime latency, training efficiency, memory optimization, and decoding speed.","Crafting efficient multi-modal LLMs and addressing unique challenges in image and audio generation.","Exploring novel optimization techniques to enhance LLM performance across diverse data representations."],"qualifications":["Graduate degree in a STEM field or equivalent industry experience in software engineering"],"yearlyPay":null,"benefits":["Opportunity to attend ML and AI courses","Mentorship from an Apple expert closely involved in the program","Collaboration with fellow residents","Gain hands-on experience working on high-impact projects","Opportunity to publish in premier academic conferences","Partner with Apple teams across hardware, software, and services","Flexible medical plans and various physical and mental health resources","Paid sick days, vacation days, and parental leave","Assistance with tuition expenses for courses that support career development at Apple","Stock grants and discounts when purchasing Apple stock","Discounts on Apple products and deals on third-party accessories and services","Apple matches donations and contributes US$25 for every hour volunteered"],"postingDate":"2025-11-07","fetchDate":"2025-11-08T03:15:03.008Z","postSource":"https://jobs.apple.com/en-us/details/200630840-0836/aiml-resident-input-experience-nlp?team=MLAI"}
{"company":"Apple","jobTitle":"AIML Resident - Responsible AI & Human Evaluation","location":"Cambridge, Massachusetts, United States","skills":["Proficiency in a programming language such as Python, Objective-C, C++, Swift, and/or R.","Experience completing a moderate-sized software project.","Demonstrated ability to connect and collaborate with others.","Domain expertise to innovate and build revolutionary machine learning and AI-based products and experiences.","Interest in key Responsible AI areas including safety, fairness, robustness, explainability, and uncertainty in models.","Familiarity with diverse evaluation approaches, including human evaluation, human-in-the-loop, and LLM-as-judge, across various modalities and languages.","Experience working on frontier generative models."],"responsibilities":["Apply domain expertise to innovate and build revolutionary machine learning and AI-based products and experiences.","Attend ML and AI courses.","Learn from an Apple mentor closely involved in the program.","Collaborate with fellow residents.","Gain hands-on experience working on high-impact projects.","Publish in premier academic conferences.","Partner with Apple teams across hardware, software, and services.","Work on frontier generative models that power Apple's new features.","Engage in longer-term research in the generative AI space."],"qualifications":["Graduate degree in a STEM field or equivalent industry experience in software engineering.","Must be available to work full-time (40 hours/week) for a one-year program, specifically from July 13, 2026, to July 9, 2027."],"yearlyPay":165550,"benefits":["Comprehensive medical and dental coverage.","Retirement benefits.","A range of discounted products and free services.","Reimbursement for certain educational expenses, including tuition, for formal education related to advancing a career at Apple.","The role might also be eligible for discretionary bonuses or commission payments, as well as relocation."],"postingDate":"2025-11-06","fetchDate":"2025-11-08T03:15:25.332Z","postSource":"https://jobs.apple.com/en-us/details/200630788-1242/aiml-resident-responsible-ai-human-evaluation?team=MLAI"}
{"company":"Apple","jobTitle":"Product Designer (UX)","location":"Sunnyvale, California, United States","skills":["7+ years of professional experience in a UX design team shipping web products","A strong portfolio showcasing relevant B2B/Enterprise design projects with an emphasis on cross-functional collaboration","Experience designing for complex, data-heavy, enterprise solutions","Experience designing software for developers across web and native applications","Skills to iterate and move features forward with stakeholders, including engineering and product management","Ability to communicate UX concepts using low and high fidelity deliverables","Ability to navigate an agile work environment and perform key tasks within sprints","Strong collaboration and communication skills within a design team and cross-functionally","A background in working on enterprise software is considered a bonus","Experience with Figma is strongly preferred","Familiarity with Apple's Human Interface Guidelines is a plus"],"responsibilities":["Contribute expertise to redefining the software that drives businesses around the world with Claris.","Design software for developers across web and native applications.","Tackle complex problems aimed at providing elegant solutions that surprise and delight users.","Work with cross-functional teams to drive results, from ideation to implementation.","Apply UX principles to solve problems and ship solutions.","Envision and specify the expected behaviors of workflows.","Utilize understanding of common design patterns, while also knowing when to innovate and break the rules.","Invest attention into details where required.","Keep the overall vision of the product experience in mind while evaluating features for enhancements.","Extend into research or prototyping based on interests.","Maintain a keen eye for the relative quality of visual interfaces."],"qualifications":["Bachelor's Degree in Design or an equivalent field (such as User Experience Design, Human-Computer Interaction, Information Science, etc.)."],"yearlyPay":226600,"benefits":["Comprehensive medical and dental coverage","Retirement benefits","A range of discounted products and free services","Reimbursement for certain educational expenses, including tuition, for formal education related to advancing a career at Apple","Opportunity to become an Apple shareholder through participation in discretionary employee stock programs","Eligible for discretionary restricted stock unit awards","Opportunity to purchase Apple stock at a discount if voluntarily participating in Apple's Employee Stock Purchase Plan"],"postingDate":"2025-10-31","fetchDate":"2025-11-08T03:15:50.318Z","postSource":"https://jobs.apple.com/en-us/details/200629250-3956/product-designer-ux?team=DESGN"}
{"company":"Apple","jobTitle":"Interaction Software Prototyper","location":"Cupertino, CA","skills":["Experience developing interactive prototypes or applications.","Experience working with sensor data such as image, video, input devices, and audio.","Knowledge of software architecture design patterns, particularly for real-time sensor processing and interfaces.","Proficiency with scripting, data processing, data visualization, and/or numerical analysis.","Algorithm and mathematics fundamentals in statistics, signal processing, machine learning, and state machine design.","3+ years of experience working in a relevant field.","Experience building interactive prototypes with machine learning technologies.","Experience working with human researchers to establish critical research tracks, interpret results, and apply learnings to product development."],"responsibilities":["Investigate new technologies.","Prototype concepts.","Build frameworks for benchmarking human performance.","Drive technical development needed to bring ideas to life.","Work on a wide array of sensing modalities such as image/video, multi-touch, and force sensing.","Work closely with multidisciplinary teams in engineering and design to deliver actionable insights to drive key decisions for Apple products including Mac, iPhone, iPad, Vision Pro, and more.","Identify novel human-sensing interaction concepts and build them into interactive prototypes.","Develop software for human research, including measurement systems and data logging for small-scale studies.","Establish success criteria and technology requirements for new interactions through prototyping, user studies, and data analysis.","Present and demo insights to engineering and design to inform key product decisions."],"qualifications":["Bachelor's degree in Computer Engineering/Computer Science, Interaction Design, Human Computer Interaction, or a related field.","Master's or doctorate degree in computer science, human-computer interaction, interaction design, or other relevant area."],"yearlyPay":147400,"benefits":["Apple employees have the opportunity to become an Apple shareholder through participation in Apple's discretionary employee stock programs."],"postingDate":"2025-10-23","fetchDate":"2025-11-08T03:16:14.922Z","postSource":"https://jobs.apple.com/en-us/details/200625633-0836/interaction-software-prototyper?team=HRDWR"}
{"company":"Apple","jobTitle":"Human-Centered AI Researcher","location":"Cupertino, California, United States","skills":["Deep HCI or social science foundations.","Applied technical understanding of AI systems for consumer products.","Experience evaluating and prototyping emerging interaction patterns, especially those involving Large Language Models (LLMs), multimodal interfaces, and dynamic UIs.","Proficiency in both quantitative and qualitative research methods and subsequent analysis.","Ability to pose critical questions about key human-AI concepts.","Ability to initiate generative research or design experiments to test explorations.","Ability to translate insights to inspire new design directions.","Deep quantitative expertise, including large-scale survey design, experimental design, psychometrics, and statistics.","Hands-on experience working with or evaluating AI systems, models, and interfaces.","Skilled at time series analysis and working with temporal data to identify patterns, trends, and insights over time and sequences of events."],"responsibilities":["Design and conduct generative and evaluative research across hardware and software experiences, particularly leveraging AI technologies.","Assess and shape AI system behaviors through human-centered evaluation frameworks.","Collaborate with design, engineering, and the research team to prototype and iterate on AI-driven interfaces and emerging interaction paradigms.","Create new measures and metrics that illuminate how people engage with AI, such as trust calibration and cognitive offloading.","Partner closely with designers, engineers, and producers/program managers to integrate human insights into the development of devices and services used by millions of people worldwide.","Support the development of hardware, software, algorithms, packaging, and retail experiences within the Apple Design Group."],"qualifications":["Proficiency in both quantitative and qualitative research methods and subsequent analysis.","Deep quantitative expertise (large-scale survey design, experimental design, psychometrics, statistics).","Hands-on experience working with or evaluating AI systems, models, and interfaces.","Skilled at time series analysis, working with temporal data to identify patterns, trends, and insights over time and sequences of events."],"yearlyPay":249750,"benefits":["Comprehensive medical and dental coverage.","Retirement benefits.","A range of discounted products and free services.","Reimbursement for certain educational expenses (including tuition) for formal education related to advancing your career at Apple."],"postingDate":"2025-05-21","fetchDate":"2025-11-08T03:16:34.510Z","postSource":"https://jobs.apple.com/en-us/details/200605909-0836/human-centered-ai-researcher?team=DESGN"}
