{"company":"Apple","jobTitle":"AIML Resident - Input Experience NLP","location":"Cupertino, California, United States","skills":["Python","Objective-C","C++","Swift","R"],"responsibilities":["Apply domain expertise to innovate and build revolutionary machine learning and AI-based products and experiences.","Gain hands-on experience by working on high-impact projects.","Contribute directly to shipping products and helping develop new features and capabilities that advance digital communication within the Input Experience NLP team.","Develop models and software for Apple Intelligence and text input features across supported languages.","Work on Writing Tools, Smart Replies, auto-correction, and predictive typing.","Collaborate with fellow residents.","Partner with Apple teams across hardware, software, and services.","Have the opportunity to publish in premier academic conferences."],"qualifications":["Experts in various fields who want to apply their domain expertise to machine learning and AI.","Submit a cover letter explaining research interests.","Submit a cover letter explaining how research interests apply to the specific Residency position.","Submit a cover letter explaining why the applicant would like to join the AIML residency program broadly.","Opportunity to attend ML and AI courses.","Opportunity to publish in premier academic conferences."],"yearlyPay":147400,"benefits":["Opportunity to become an Apple shareholder through participation in discretionary employee stock programs.","Eligibility for discretionary restricted stock unit awards.","Option to purchase Apple stock at a discount by voluntarily participating in Apple's Employee Stock Purchase Plan.","Comprehensive medical coverage.","Comprehensive dental coverage.","Retirement benefits.","A range of other unspecified benefits."],"postingDate":"2025-11-06","fetchDate":"2025-11-08T02:45:52.661Z","postSource":"https://jobs.apple.com/en-us/details/200630840-0836/aiml-resident-input-experience-nlp?team=MLAI"}
{"company":"Apple","jobTitle":"AIML Resident - Siri Agent Modeling","location":"Cupertino, California, United States","skills":["Python","Objective-C","C++","Swift","R","software project completion","collaboration"],"responsibilities":["Conduct high-quality research on post-training multi-modal large language models using Supervised Fine-Tuning (SFT) and Reinforcement Learning (RL) techniques (e.g., using GRPO) to enable rich agentic experiences on Apple devices.","Work on sample streams including reinforcement learning for general tool-use, building/enhancing planning and reasoning capabilities in Large Language Models (LLMs), and building/enhancing multimodal large language models for computer use.","Have the flexibility to build product prototypes using the developed models.","Attend ML and AI courses.","Learn from an Apple mentor closely involved in their program.","Collaborate with fellow residents.","Gain hands-on experience working on high-impact projects.","Publish in premier academic conferences.","Partner with Apple teams across hardware, software, and services."],"qualifications":["A graduate degree in a STEM field or equivalent industry experience in software engineering is required.","Applicants who are currently enrolled in a degree program must graduate before the program commences on July 13, 2026."],"yearlyPay":null,"benefits":[],"postingDate":"2025-11-06","fetchDate":"2025-11-08T02:46:09.622Z","postSource":"https://jobs.apple.com/en-us/details/200630837-0836/aiml-resident-siri-agent-modeling?team=MLAI"}
{"company":"Apple","jobTitle":"AIML Resident - Shortcuts","location":"Cupertino","skills":["Proficiency in a programming language such as Python, Objective-C, C++, Swift, and/or R.","Experience completing a moderate-sized software project.","Demonstrated ability to connect and collaborate with others.","Academic, research, or industry experience in one of the following areas is preferred: Information Extraction, Distributed Systems, Large Language Models / Generative AI, or Search and Information Retrieval. Thesis, capstone project, internship, co-op, and/or proven experience in these fields qualifies."],"responsibilities":["The AIML Resident program is a year-long program designed for experts to apply their domain expertise to innovate and build revolutionary machine learning and AI-based products and experiences.","Specifically for the Shortcuts team, residents will be involved in applying groundbreaking machine learning to empower users to do more with their devices, focusing on building intuitive, intelligent automation systems.","Residents will attend ML and AI courses.","Residents will learn from an Apple mentor closely involved in their program.","Residents will collaborate with fellow residents.","Residents will gain hands-on experience working on high-impact projects.","Residents will publish in premier academic conferences.","Residents will partner with Apple teams across hardware, software, and services."],"qualifications":["Graduate degree in a STEM field or equivalent industry experience in software engineering.","Residents must be available to work full-time (40 hours/week) from July 13, 2026, to July 9, 2027.","Applicants currently enrolled in a degree program must graduate before the program commences on July 13, 2026.","A cover letter is encouraged as part of the application, explaining research interests, how they apply to the specific Residency position, and why the applicant would like to join the AIML residency program broadly."],"yearlyPay":184150,"benefits":["Comprehensive medical and dental coverage.","Retirement benefits.","Discounted products and free services.","Reimbursement for certain educational expenses, including tuition, for formal education related to advancing a career at Apple.","Discretionary bonuses or commission payments (role might be eligible).","Relocation assistance (role might be eligible)."],"postingDate":"2025-11-07","fetchDate":"2025-11-08T02:46:31.265Z","postSource":"https://jobs.apple.com/en-us/details/200630839-0836/aiml-resident-shortcuts?team=MLAI"}
{"company":"Apple","jobTitle":"AIML Resident - Machine Learning Platform Technologies (MLPT)","location":null,"skills":["Python","Objective-C","C++","Swift","R","Software project experience","Collaboration skills"],"responsibilities":["Apply domain expertise to innovate and build revolutionary machine learning and AI-based products and experiences.","Attend ML and AI courses.","Learn from an Apple mentor closely involved in their program.","Collaborate with fellow residents.","Gain hands-on experience working on high-impact projects.","Publish in premier academic conferences.","Partner with Apple teams across hardware, software, and services.","Work on impactful projects at the intersection of large-scale data processing, data extraction, and AI model development.","Receive mentorship from experienced engineers.","Contribute to research that bridges foundational advances with real-world applications.","Potentially conduct research in human biases and algorithmic fairness in ML, including methods to discover, explain, and mitigate biases in Large Language Models (if part of the ML Research team focus).","Potentially work on ambitious technical problems, collaborate with world-class machine learning engineers and researchers, and develop new ML solutions that will impact future Apple products (if part of the ML Research team focus)."],"qualifications":["Graduate degree in a STEM field or equivalent industry experience in software engineering.","Academic, research, or industry experience in Human-AI Interaction, Behavioral Science, Cognitive Science, LLMs/Generative AI, or Statistics/Econometrics.","Thesis, capstone project, internship, co-op, or proven experience in relevant fields."],"yearlyPay":null,"benefits":["Comprehensive medical and dental coverage","Retirement benefits","Discounted products and free services","Reimbursement for certain educational expenses, including tuition","Discretionary bonuses or commission payments","Relocation assistance"],"postingDate":"2024-11-16","fetchDate":"2025-11-08T02:46:57.893Z","postSource":"https://jobs.apple.com/en-us/details/200630802-3760/aiml-resident-machine-learning-platform-technologies-mlpt?team=MLAI"}
{"company":"Apple","jobTitle":"Applied Machine Learning Research Engineer - Multimodal LLMs for Human Understanding","location":"Sunnyvale, California, United States","skills":["Developing, training/tuning multimodal Large Language Models (LLMs)","Developing and exploring multimodal large language models integrating text, image, video, and audio","Python programming","Computer vision","Natural Language Processing (NLP)","Multimodal fusion","Generative AI","JAX deep learning framework","PyTorch deep learning framework","Deep learning frameworks"],"responsibilities":["Work on groundbreaking research projects to advance AI and computer vision capabilities.","Contribute to both foundational research and practical applications on multimodal large language models.","Design, implement, and evaluate algorithms and models for human understanding.","Collaborate with multi-functional teams including researchers, data scientists, software engineers, human interface designers, and application domain experts.","Stay up-to-date on the latest advancements in AI, machine learning, and computer vision and apply this knowledge to drive innovation within the company.","Balance research and product requirements to deliver Apple quality, pioneering experiences, innovating through the full stack, and partnering with HW, SW, and AI teams to shape Apple's products."],"qualifications":["Bachelor's degree and a minimum of 3 years of relevant industry experience.","Masters degree with a minimum of 3 years relevant industry experience.","PhD in Computer Science, Electrical Engineering, or a related field with a focus on AI, machine learning, or computer vision.","Publication record in relevant venues."],"yearlyPay":209750,"benefits":["Flexible medical plans (physical and mental healthcare)","Virtual and in-person medical professional access","Free confidential counseling","Onsite wellness centers with doctors, nurses, dietitians, acupuncturists (at major campuses)","Fitness centers","Subsidized gym memberships/wellness reimbursements","Comprehensive dental insurance","Eye care","Health classes","Fertility assistance (including egg freezing)","Pet insurance","Apple stock grants and discount for purchasing Apple stock","401(k) matching","Income protection (e.g., life insurance coverage)","Employee Stock Purchase Program (ESPP)","Flexible Spending Account (FSA)","Roth 401(k)","Mega Backdoor Roth IRA option","Paid time off (vacation, sick leave)","Paid parental leave (maternity, paternity, adoptive)","Covered adoption-related costs","Tuition reimbursement","Apple University classes and seminars","Learning and development programs/workshops","Employee discounts on Apple products","Annual credit for Apple accessories","Custom workstations","Charitable giving program with company match","Volunteering leave with company contribution","Shuttle services and free bus service (for Cupertino facility)"],"postingDate":"2025-11-06","fetchDate":"2025-11-08T02:48:03.970Z","postSource":"https://jobs.apple.com/en-us/details/200630862-3956/applied-machine-learning-research-engineer-multimodal-llms-for-human-understanding?team=MLAI"}
