{"company":"Apple","jobTitle":"Software Engineer, Payments","skills":["Experience with Swift and Objective-C.","Strong background in data structures and algorithms.","Excellent problem solving, critical thinking, and communication skills.","Experience in designing, implementing, and testing large scale services.","Proficiency in one or more of the following languages: Java, Python, Go.","Experience with relational databases and NoSQL databases.","Knowledge of various cloud technologies (e.g., AWS, Azure, GCP).","Understanding of RESTful API design and microservices architecture.","Familiarity with CI/CD pipelines and automated testing.","Experience with monitoring and alerting tools.","Strong understanding of security principles and best practices.","Experience with processing high volume transactions is a plus.","Experience with GraphQL is a plus."],"responsibilities":["Design, develop, and maintain scalable and reliable payment processing systems.","Collaborate with cross-functional teams to define and implement new features.","Write clean, well-tested, and maintainable code.","Participate in code reviews and provide constructive feedback.","Troubleshoot and resolve production issues.","Monitor system performance and identify areas for improvement.","Stay up-to-date with the latest technologies and trends in the payments industry."],"postingDate":null,"postSource":"https://jobs.apple.com/en-us/details/200630986-0836/software-engineer-payments?team=SFTWR"}
{"company":"Apple","jobTitle":"Machine Learning Evaluations Manager","location":"Seattle, Washington","skills":["Experience managing teams of annotation specialists","Experience with machine learning","Experience in data collection and annotation","Experience with natural language processing (NLP) or speech recognition","Excellent written and verbal communication skills","Strong analytical and problem-solving skills","Ability to work independently and as part of a team","Experience with data analysis tools such as SQL, Python, or R is a plus","Experience with cloud computing platforms such as AWS or Azure is a plus"],"responsibilities":["Manage a team of annotation specialists responsible for evaluating the quality of machine learning models.","Develop and implement evaluation plans for machine learning models.","Analyze evaluation results and identify areas for improvement.","Work with machine learning engineers to improve the quality of machine learning models.","Communicate evaluation results to stakeholders.","Develop and maintain documentation for evaluation processes.","Stay up-to-date on the latest trends in machine learning."],"qualifications":["Bachelor's degree in a related field","5+ years of experience in data collection and annotation, machine learning, or a related field","2+ years of experience managing teams"],"yearlyPay":null,"benefits":["Health insurance","PTO","Other benefits not specified"],"postingDate":null,"fetchDate":"2025-11-08T02:26:45.351Z","postSource":"https://jobs.apple.com/en-us/details/200630627-0836/machine-learning-evaluations-manager?team=MLAI"}
{"company":"Apple","jobTitle":"SwiftUI/Mac Frameworks Engineer","location":"Cupertino, California","skills":["Experience shipping software in Swift and Objective-C","Experience building desktop applications","Experience with macOS frameworks such as AppKit, SwiftUI, Core Animation, and Foundation","Excellent debugging and critical thinking skills","Strong object-oriented programming skills","Knowledge of reactive programming paradigms","Experience with profiling tools","Experience writing unit and performance tests"],"responsibilities":["Design and implement delightful APIs and systems for use by developers at Apple and throughout the world.","Collaborate closely with other engineering teams at Apple to deliver groundbreaking new features for our platforms.","Write high-quality, well-tested code."],"qualifications":["BS/MS in Computer Science or equivalent experience"],"yearlyPay":null,"benefits":["Apple's benefits may include health insurance, retirement plans, employee stock purchase plan, paid time off, employee discounts, and various wellness programs. Specific benefits details can vary."],"postingDate":null,"fetchDate":"2025-11-08T02:26:48.735Z","postSource":"https://jobs.apple.com/en-us/details/200630960-0836/swiftui-mac-frameworks-engineer?team=SFTWR"}
{"company":"Apple","jobTitle":" acoustic Transducer Engineer","location":"Cupertino, California","skills":["Acoustics","Vibrations","Transducer design","Finite Element Analysis (FEA)","Lumped element modeling","Matlab","COMSOL","Prototyping","Data analysis","Characterization","Problem-solving","Communication"],"responsibilities":["Design and develop acoustic transducers for innovative Apple products.","Create acoustic transducer designs and generate specifications from system requirements.","Simulate transducer performance using FEA and lumped element models.","Build and test prototypes to validate design performance.","Analyze data to optimize transducer performance.","Collaborate with cross-functional teams to integrate transducers into product designs."],"qualifications":["BS/MS/Ph.D. in Mechanical Engineering, Electrical Engineering, Physics, Acoustics or related field.","Experience in acoustic and vibration related field."],"yearlyPay":null,"benefits":["Health insurance","Other benefits not explicitly listed, but generally associated with Apple employment"],"postingDate":null,"fetchDate":"2025-11-08T02:26:52.478Z","postSource":"https://jobs.apple.com/en-us/details/200630603-0365/%EF%A3%BF-acoustic-transducer-engineer?team=HRDWR"}
{"company":"Apple","jobTitle":"QA Manager - Video Apps","location":"Culver City, California","skills":["Experience in quality assurance methodologies","Experience in software development lifecycle","Experience in media playback","Experience with tvOS, iOS, macOS, and other media devices","Experience managing people","Familiarity with industry-standard test management and bug tracking tools","Excellent communication, interpersonal, and leadership skills"],"responsibilities":["Lead and mentor a team of QA engineers.","Drive test strategy and execution for Apple's video applications.","Collaborate with cross-functional teams to ensure high-quality product releases.","Define and implement QA processes and best practices.","Analyze test results and provide actionable insights to stakeholders.","Manage and prioritize testing efforts to meet project deadlines.","Advocate for quality throughout the development lifecycle."],"qualifications":["5+ years of experience in Quality Assurance","2+ years of experience in a leadership role"],"yearlyPay":null,"benefits":["Health insurance","Other benefits mentioned on Apple's career page"],"postingDate":null,"fetchDate":"2025-11-08T02:26:56.188Z","postSource":"https://jobs.apple.com/en-us/details/200631021-0836/qa-manager-video-apps?team=SFTWR"}
{"company":"Apple","jobTitle":"Software Development Engineer, Test","location":"Austin, Texas","skills":["Experience with Swift/Objective-C, and Cocoa/CocoaTouch frameworks","Proficiency in at least one modern programming language such as Python, Java, or C++","Experience with UI automation frameworks such as XCUITest, Appium, or Espresso","Familiarity with continuous integration systems such as Jenkins or TeamCity","Experience with Git or other version control systems"],"responsibilities":["Design, develop, and maintain test automation frameworks and test suites.","Write and execute test cases for iOS applications.","Analyze test results and identify root cause of failures.","Collaborate with developers to ensure the quality of the product.","Participate in code reviews and contribute to the improvement of the codebase.","Develop tools and scripts to automate testing processes."],"qualifications":["A BS/MS degree in Computer Science, Computer Engineering, or equivalent experience is required."],"yearlyPay":null,"benefits":["Apple's benefits programs are designed to provide you with the support you need to thrive at work and in every aspect of your life, including time away, health and well-being, financial planning, family support, professional development, and employee discounts."],"postingDate":null,"fetchDate":"2025-11-08T02:27:00.070Z","postSource":"https://jobs.apple.com/en-us/details/200630980-3543/software-development-engineer-test?team=SFTWR"}
{"company":"Apple","jobTitle":"Sr. Audio Software Engineer - Vision Products Group (VPG)","location":"Sunnyvale, California","skills":["Extensive experience with audio processing algorithms","Proficiency in C or C++","Experience with multithreaded programming","Knowledge of audio frameworks on macOS, iOS, or similar","Familiarity with microphone array processing","Experience with acoustic echo cancellation, noise reduction, beamforming","Experience with audio rendering, spatial audio, HRTFs","Knowledge of audio codecs and streaming protocols","Experience with low-latency audio processing","Experience shipping high-quality audio products"],"responsibilities":["Design, implement, and optimize audio processing algorithms for Apple's innovative products.","Collaborate with cross-functional teams to define audio system requirements and specifications.","Develop and maintain audio frameworks and libraries for various platforms.","Profile and optimize audio code for performance and power efficiency.","Debug and resolve complex audio issues in a timely manner.","Stay up-to-date with the latest audio technologies and trends."],"qualifications":["BS/MS in Computer Science, Electrical Engineering, or related field.","5+ years of experience in audio software development."],"yearlyPay":null,"benefits":["Not explicitly mentioned, refer to Apple's benefits program."],"postingDate":null,"fetchDate":"2025-11-08T02:27:04.196Z","postSource":"https://jobs.apple.com/en-us/details/200629540-3401/sr-audio-software-engineer-vision-products-group-vpg?team=SFTWR"}
{"company":"Apple","jobTitle":"Engineering Project Manager - Instructional Products","location":"Cupertino, California","skills":["Experience working with localization teams and understanding localization processes.","Proven ability to work multi-functionally, and to influence without direct authority.","Excellent communication, interpersonal and presentation skills.","Ability to filter and distill relevant information for the right audience.","Experience working with engineering teams and driving complex technical projects.","Proficiency in tools and processes for project tracking, bug reporting, and documentation.","Experience with Agile development methodologies.","Familiarity with software development lifecycle (SDLC).","Experience in content creation, technical writing, or instructional design is a plus.","Experience with video production or editing is a plus.","Knowledge of Apple products and technologies is a plus."],"responsibilities":["Drive complex engineering projects from inception to delivery, ensuring alignment with product strategy and business goals.","Collaborate with cross-functional teams, including engineering, content, localization, and quality assurance, to define project scope, objectives, and deliverables.","Develop and maintain detailed project plans, schedules, and resource allocation, tracking progress and identifying potential risks and mitigation strategies.","Facilitate communication and collaboration among project stakeholders, providing regular updates on project status, risks, and dependencies.","Manage project scope, budget, and resources, ensuring projects are delivered on time and within budget.","Identify and resolve project issues and conflicts, escalating as necessary to ensure timely resolution.","Drive continuous improvement in project management processes and methodologies, identifying opportunities to enhance efficiency and effectiveness.","Ensure that all project deliverables meet quality standards and are aligned with Apple's brand and design guidelines.","Manage vendor relationships, including contract negotiation, performance monitoring, and issue resolution."],"qualifications":["Bachelor’s degree in a technical field (e.g., Computer Science, Engineering) or equivalent experience.","5+ years of experience in project management, with a focus on software development or instructional design.","PMP or other project management certification is a plus."],"yearlyPay":null,"benefits":["Health insurance","Apple's benefits programs are designed to care for you and your family — your health, your wealth, and your well-being. We offer valuable resources and smart tools, coverage for medical, dental, vision, life, and disability, ways to save for the future, time-off programs, paid parental leave and employee discounts."],"postingDate":null,"fetchDate":"2025-11-08T02:27:10.449Z","postSource":"https://jobs.apple.com/en-us/details/200630758-0836/engineering-project-manager-instructional-products?team=SFTWR"}
{"company":"Apple","jobTitle":"Staff Software Engineer, Applied AI","location":"Seattle, Washington","skills":["Experience shipping products with machine learning components.","Strong programming skills in Python, C++, or similar languages.","Experience with deep learning frameworks such as TensorFlow, PyTorch, or JAX.","Experience building and deploying large-scale machine learning systems.","Excellent communication and collaboration skills.","Familiarity with classical machine learning techniques.","Experience with transformer models and related techniques."],"responsibilities":["Design, develop, and deploy machine learning models for Apple products and services.","Collaborate with cross-functional teams to define product requirements and specifications.","Conduct research and experimentation to improve the accuracy and efficiency of machine learning models.","Monitor and maintain machine learning models in production.","Mentor junior engineers and contribute to the growth of the team."],"qualifications":["Bachelor's degree in Computer Science or a related field.","5+ years of experience in software engineering or machine learning."],"yearlyPay":null,"benefits":["Apple's benefits may include health insurance, retirement plans, employee stock purchase program, paid time off, and other perks."],"postingDate":null,"fetchDate":"2025-11-08T02:27:13.880Z","postSource":"https://jobs.apple.com/en-us/details/200630749-0836/staff-software-engineer-applied-ai?team=MLAI"}
{"company":"Apple","jobTitle":"Sensing Hardware Algorithm & Systems Engineering Director","location":"Sunnyvale, California","skills":["Experience shipping high-volume consumer electronics products with sophisticated sensing systems.","Deep understanding of sensor technologies (e.g. optical, acoustic, inertial, environmental, etc.) and associated algorithms.","Experience with system-level architecture and optimization, including hardware/software partitioning.","Proficiency in data analysis and statistical modeling using tools such as Python, MATLAB, or JMP.","Strong background in signal processing, machine learning, and/or control systems.","Excellent communication, collaboration, and leadership skills to work effectively across diverse teams.","Proven track record of building and managing high-performing engineering teams.","Extensive experience in algorithm development, simulation, and validation.","Familiarity with sensor calibration, compensation, and error modeling techniques.","Experience with statistical process control and design of experiments for sensor characterization.","Knowledge of regulatory requirements and industry standards for sensor performance and safety."],"responsibilities":["Lead a team of talented engineers to develop innovative sensing solutions for future Apple products.","Define the system architecture and performance requirements for sensing hardware and algorithms.","Drive the development of advanced algorithms for sensor calibration, data fusion, and signal processing.","Collaborate with cross-functional teams to integrate sensing systems into product designs.","Oversee the validation and testing of sensing systems to ensure high accuracy and reliability.","Manage the team’s budget, resources, and project timelines.","Stay abreast of the latest advancements in sensing technologies and identify opportunities for innovation.","Foster a culture of technical excellence, collaboration, and continuous improvement within the team."],"qualifications":["Ph.D. or Master's degree in Electrical Engineering, Computer Science, Physics, or a related field.","15+ years of experience in sensing system development and algorithm design."],"yearlyPay":null,"benefits":["Apple's benefits include stock options","health insurance","401k","PTO","and more comprehensive plans."],"postingDate":null,"fetchDate":"2025-11-08T02:27:19.179Z","postSource":"https://jobs.apple.com/en-us/details/200629781-0836/sensing-hardware-algorithm-systems-engineering-director?team=HRDWR"}
{"company":"Apple","jobTitle":"AI Data Tools Engineer","location":"Seattle, Washington","skills":["Experience with data labeling","Proficiency in one or more programming languages such as Python, Java, or Swift","Familiarity with machine learning concepts and algorithms","Experience with data manipulation and analysis libraries such as Pandas, NumPy, or Scikit-learn","Experience with cloud computing platforms such as AWS, Azure, or GCP","Experience with databases such as SQL or NoSQL","Experience with data visualization tools such as Tableau or PowerBI","Experience with version control systems such as Git","Strong problem-solving and analytical skills","Excellent communication and collaboration skills"],"responsibilities":["Develop and maintain data labeling tools and infrastructure.","Collaborate with machine learning engineers to understand data requirements.","Implement data validation and quality control processes.","Automate data labeling workflows.","Monitor and improve the performance of data labeling tools.","Contribute to the development of data labeling guidelines and best practices."],"qualifications":["Bachelor’s degree in Computer Science or related field, or equivalent experience"],"yearlyPay":null,"benefits":["Health insurance","PTO"],"postingDate":null,"fetchDate":"2025-11-08T02:27:22.734Z","postSource":"https://jobs.apple.com/en-us/details/200630748-0157/ai-data-tools-engineer?team=MLAI"}
{"company":"Apple","jobTitle":"Software Engineer - Apple Pay","location":"Santa Clara Valley, California","skills":["Experience in Java or Swift.","Familiarity with web services, REST APIs, and backend systems.","Excellent object-oriented programming and design skills.","Knowledge of data structures, algorithm design, and problem-solving.","Strong communication and collaboration skills.","Experience with payments or financial systems is a plus.","Experience with large-scale, distributed systems is a plus.","Experience with GraphQL is a plus."],"responsibilities":["Design and develop features for Apple Pay.","Write high-quality, maintainable code.","Collaborate with other engineers, designers, and product managers.","Participate in code reviews.","Troubleshoot and debug issues.","Contribute to the overall architecture and design of the Apple Pay platform."],"qualifications":["Bachelor’s degree in Computer Science or related field, or equivalent experience."],"yearlyPay":null,"benefits":["Apple's benefits programs are designed to care for you and your family — your health, your wealth, and your well-being. Apple offers a range of plans and resources to help you take care of your health, including medical, dental, and vision coverage. You’ll also have access to a variety of wellness programs, such as fitness classes and nutrition counseling. Apple’s financial benefits can help you save and invest for the future, including a 401(k) plan with company matching and an employee stock purchase plan. You’ll also receive paid time off for vacation, sick leave, and holidays. And there are many other perks too, including employee discounts on Apple products, commuter benefits, and more."],"postingDate":null,"fetchDate":"2025-11-08T02:27:27.518Z","postSource":"https://jobs.apple.com/en-us/details/200630949-0836/software-engineer-apple-pay?team=SFTWR"}
{"company":"Apple","jobTitle":"Product RF Design Engineer","location":"San Diego, California","skills":["RF system design","System level RF performance analysis","RF block and system level simulation","Familiarity with RF test equipment (spectrum analyzers, signal generators, network analyzers, communication testers)","Experience with RF design and characterization of wireless communication systems (WLAN, Bluetooth, Cellular)","Experience with RFIC design and characterization","Knowledge of wireless communication standards and regulatory requirements","Experience with statistical data analysis and modeling using tools such as MATLAB or Python"],"responsibilities":["Design and develop RF solutions for wireless products.","Conduct system-level RF performance analysis and simulation.","Perform RF block-level design and simulation.","Characterize and test RF performance using industry-standard equipment.","Collaborate with cross-functional teams to integrate RF solutions into products.","Ensure compliance with wireless communication standards and regulatory requirements.","Analyze statistical data and create models using tools like MATLAB or Python."],"qualifications":["BSEE/MSEE with 5+ years of relevant experience"],"yearlyPay":null,"benefits":["Not explicitly specified in the job posting, so refer to Apple's general benefits package."],"postingDate":null,"fetchDate":"2025-11-08T02:27:32.386Z","postSource":"https://jobs.apple.com/en-us/details/200629269-0157/product-rf-design-engineer?team=HRDWR"}
{"company":"Apple","jobTitle":"AIML Resident - Input Experience NLP","location":"Cupertino, California, United States","skills":["Python","Objective-C","C++","Swift","R"],"responsibilities":["Apply domain expertise to innovate and build revolutionary machine learning and AI-based products and experiences.","Gain hands-on experience by working on high-impact projects.","Contribute directly to shipping products and helping develop new features and capabilities that advance digital communication within the Input Experience NLP team.","Develop models and software for Apple Intelligence and text input features across supported languages.","Work on Writing Tools, Smart Replies, auto-correction, and predictive typing.","Collaborate with fellow residents.","Partner with Apple teams across hardware, software, and services.","Have the opportunity to publish in premier academic conferences."],"qualifications":["Experts in various fields who want to apply their domain expertise to machine learning and AI.","Submit a cover letter explaining research interests.","Submit a cover letter explaining how research interests apply to the specific Residency position.","Submit a cover letter explaining why the applicant would like to join the AIML residency program broadly.","Opportunity to attend ML and AI courses.","Opportunity to publish in premier academic conferences."],"yearlyPay":147400,"benefits":["Opportunity to become an Apple shareholder through participation in discretionary employee stock programs.","Eligibility for discretionary restricted stock unit awards.","Option to purchase Apple stock at a discount by voluntarily participating in Apple's Employee Stock Purchase Plan.","Comprehensive medical coverage.","Comprehensive dental coverage.","Retirement benefits.","A range of other unspecified benefits."],"postingDate":"2025-11-06","fetchDate":"2025-11-08T02:45:52.661Z","postSource":"https://jobs.apple.com/en-us/details/200630840-0836/aiml-resident-input-experience-nlp?team=MLAI"}
{"company":"Apple","jobTitle":"AIML Resident - Siri Agent Modeling","location":"Cupertino, California, United States","skills":["Python","Objective-C","C++","Swift","R","software project completion","collaboration"],"responsibilities":["Conduct high-quality research on post-training multi-modal large language models using Supervised Fine-Tuning (SFT) and Reinforcement Learning (RL) techniques (e.g., using GRPO) to enable rich agentic experiences on Apple devices.","Work on sample streams including reinforcement learning for general tool-use, building/enhancing planning and reasoning capabilities in Large Language Models (LLMs), and building/enhancing multimodal large language models for computer use.","Have the flexibility to build product prototypes using the developed models.","Attend ML and AI courses.","Learn from an Apple mentor closely involved in their program.","Collaborate with fellow residents.","Gain hands-on experience working on high-impact projects.","Publish in premier academic conferences.","Partner with Apple teams across hardware, software, and services."],"qualifications":["A graduate degree in a STEM field or equivalent industry experience in software engineering is required.","Applicants who are currently enrolled in a degree program must graduate before the program commences on July 13, 2026."],"yearlyPay":null,"benefits":[],"postingDate":"2025-11-06","fetchDate":"2025-11-08T02:46:09.622Z","postSource":"https://jobs.apple.com/en-us/details/200630837-0836/aiml-resident-siri-agent-modeling?team=MLAI"}
{"company":"Apple","jobTitle":"AIML Resident - Shortcuts","location":"Cupertino","skills":["Proficiency in a programming language such as Python, Objective-C, C++, Swift, and/or R.","Experience completing a moderate-sized software project.","Demonstrated ability to connect and collaborate with others.","Academic, research, or industry experience in one of the following areas is preferred: Information Extraction, Distributed Systems, Large Language Models / Generative AI, or Search and Information Retrieval. Thesis, capstone project, internship, co-op, and/or proven experience in these fields qualifies."],"responsibilities":["The AIML Resident program is a year-long program designed for experts to apply their domain expertise to innovate and build revolutionary machine learning and AI-based products and experiences.","Specifically for the Shortcuts team, residents will be involved in applying groundbreaking machine learning to empower users to do more with their devices, focusing on building intuitive, intelligent automation systems.","Residents will attend ML and AI courses.","Residents will learn from an Apple mentor closely involved in their program.","Residents will collaborate with fellow residents.","Residents will gain hands-on experience working on high-impact projects.","Residents will publish in premier academic conferences.","Residents will partner with Apple teams across hardware, software, and services."],"qualifications":["Graduate degree in a STEM field or equivalent industry experience in software engineering.","Residents must be available to work full-time (40 hours/week) from July 13, 2026, to July 9, 2027.","Applicants currently enrolled in a degree program must graduate before the program commences on July 13, 2026.","A cover letter is encouraged as part of the application, explaining research interests, how they apply to the specific Residency position, and why the applicant would like to join the AIML residency program broadly."],"yearlyPay":184150,"benefits":["Comprehensive medical and dental coverage.","Retirement benefits.","Discounted products and free services.","Reimbursement for certain educational expenses, including tuition, for formal education related to advancing a career at Apple.","Discretionary bonuses or commission payments (role might be eligible).","Relocation assistance (role might be eligible)."],"postingDate":"2025-11-07","fetchDate":"2025-11-08T02:46:31.265Z","postSource":"https://jobs.apple.com/en-us/details/200630839-0836/aiml-resident-shortcuts?team=MLAI"}
{"company":"Apple","jobTitle":"AIML Resident - Machine Learning Platform Technologies (MLPT)","location":null,"skills":["Python","Objective-C","C++","Swift","R","Software project experience","Collaboration skills"],"responsibilities":["Apply domain expertise to innovate and build revolutionary machine learning and AI-based products and experiences.","Attend ML and AI courses.","Learn from an Apple mentor closely involved in their program.","Collaborate with fellow residents.","Gain hands-on experience working on high-impact projects.","Publish in premier academic conferences.","Partner with Apple teams across hardware, software, and services.","Work on impactful projects at the intersection of large-scale data processing, data extraction, and AI model development.","Receive mentorship from experienced engineers.","Contribute to research that bridges foundational advances with real-world applications.","Potentially conduct research in human biases and algorithmic fairness in ML, including methods to discover, explain, and mitigate biases in Large Language Models (if part of the ML Research team focus).","Potentially work on ambitious technical problems, collaborate with world-class machine learning engineers and researchers, and develop new ML solutions that will impact future Apple products (if part of the ML Research team focus)."],"qualifications":["Graduate degree in a STEM field or equivalent industry experience in software engineering.","Academic, research, or industry experience in Human-AI Interaction, Behavioral Science, Cognitive Science, LLMs/Generative AI, or Statistics/Econometrics.","Thesis, capstone project, internship, co-op, or proven experience in relevant fields."],"yearlyPay":null,"benefits":["Comprehensive medical and dental coverage","Retirement benefits","Discounted products and free services","Reimbursement for certain educational expenses, including tuition","Discretionary bonuses or commission payments","Relocation assistance"],"postingDate":"2024-11-16","fetchDate":"2025-11-08T02:46:57.893Z","postSource":"https://jobs.apple.com/en-us/details/200630802-3760/aiml-resident-machine-learning-platform-technologies-mlpt?team=MLAI"}
{"company":"Apple","jobTitle":"Applied Machine Learning Research Engineer - Multimodal LLMs for Human Understanding","location":"Sunnyvale, California, United States","skills":["Developing, training/tuning multimodal Large Language Models (LLMs)","Developing and exploring multimodal large language models integrating text, image, video, and audio","Python programming","Computer vision","Natural Language Processing (NLP)","Multimodal fusion","Generative AI","JAX deep learning framework","PyTorch deep learning framework","Deep learning frameworks"],"responsibilities":["Work on groundbreaking research projects to advance AI and computer vision capabilities.","Contribute to both foundational research and practical applications on multimodal large language models.","Design, implement, and evaluate algorithms and models for human understanding.","Collaborate with multi-functional teams including researchers, data scientists, software engineers, human interface designers, and application domain experts.","Stay up-to-date on the latest advancements in AI, machine learning, and computer vision and apply this knowledge to drive innovation within the company.","Balance research and product requirements to deliver Apple quality, pioneering experiences, innovating through the full stack, and partnering with HW, SW, and AI teams to shape Apple's products."],"qualifications":["Bachelor's degree and a minimum of 3 years of relevant industry experience.","Masters degree with a minimum of 3 years relevant industry experience.","PhD in Computer Science, Electrical Engineering, or a related field with a focus on AI, machine learning, or computer vision.","Publication record in relevant venues."],"yearlyPay":209750,"benefits":["Flexible medical plans (physical and mental healthcare)","Virtual and in-person medical professional access","Free confidential counseling","Onsite wellness centers with doctors, nurses, dietitians, acupuncturists (at major campuses)","Fitness centers","Subsidized gym memberships/wellness reimbursements","Comprehensive dental insurance","Eye care","Health classes","Fertility assistance (including egg freezing)","Pet insurance","Apple stock grants and discount for purchasing Apple stock","401(k) matching","Income protection (e.g., life insurance coverage)","Employee Stock Purchase Program (ESPP)","Flexible Spending Account (FSA)","Roth 401(k)","Mega Backdoor Roth IRA option","Paid time off (vacation, sick leave)","Paid parental leave (maternity, paternity, adoptive)","Covered adoption-related costs","Tuition reimbursement","Apple University classes and seminars","Learning and development programs/workshops","Employee discounts on Apple products","Annual credit for Apple accessories","Custom workstations","Charitable giving program with company match","Volunteering leave with company contribution","Shuttle services and free bus service (for Cupertino facility)"],"postingDate":"2025-11-06","fetchDate":"2025-11-08T02:48:03.970Z","postSource":"https://jobs.apple.com/en-us/details/200630862-3956/applied-machine-learning-research-engineer-multimodal-llms-for-human-understanding?team=MLAI"}
